---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LineLightShape.#ctor(Autodesk.Revit.DB.Lighting.LineLightShape)
source: html/02cb7d90-f274-2bb9-6933-7053e9cab49e.htm
---
# Autodesk.Revit.DB.Lighting.LineLightShape.#ctor Method

Creates a copy of the given line light shape

## Syntax (C#)
```csharp
public LineLightShape(
	LineLightShape other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.LineLightShape`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null